app/Models/AboutModel.php

    public function getAboutValues($aboutPageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('about_values');

        return $builder
            ->where('about_page_id', $aboutPageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `about_values`
WHERE `about_page_id` = '1'
ORDER BY `display_order` ASC

    public function getAboutStats($aboutPageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('about_stats');

        return $builder
            ->where('about_page_id', $aboutPageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `about_stats`
WHERE `about_page_id` = '1'
ORDER BY `display_order` ASC