app/Models/CareerModel.php

SELECT *
FROM `career_benefits`
WHERE `career_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getBenefits($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('career_benefits');

        return $builder
            ->where('career_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `career_positions`
WHERE `career_page_id` = '1'
AND `is_active` = 1
ORDER BY `display_order` ASC
---
    public function getActivePositions($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('career_positions');

        return $builder
            ->where('career_page_id', $pageId)
            ->where('is_active', 1)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();