app/Models/HomeModel.php

    public function getHomeStats($homePageId)
    {
        return $this->db->table('home_stats')
            ->where('home_page_id', $homePageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `home_stats`
WHERE `home_page_id` = '1'
ORDER BY `display_order` ASC

    public function getHomeFeatures($homePageId)
    {
        return $this->db->table('home_features')
            ->where('home_page_id', $homePageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `home_features`
WHERE `home_page_id` = '1'
ORDER BY `display_order` ASC

    public function getHomeServices($homePageId)
    {
        $services = $this->db->table('home_services')
            ->where('home_page_id', $homePageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `home_services`
WHERE `home_page_id` = '1'
ORDER BY `display_order` ASC