app/Models/IndustryModel.php

SELECT *
FROM `travel_tourism_pages`
WHERE `page_name` = 'travel-tourism'
---
    public function getPageByName($pageName)
    {
        // Cari di industry_pages terlebih dahulu
        $page = $this->where('page_name', $pageName)->first();

        if (!$page) {
            // Coba cari di travel_tourism_pages
            $db = \Config\Database::connect();
            $builder = $db->table('travel_tourism_pages');
            $travelPage = $builder->where('page_name', $pageName)->get()->getRowArray();

SELECT *
FROM `industry_solutions`
WHERE `industry_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getSolutions($pageId)
    {
        $db = \Config\Database::connect();

        // Cek apakah page_id termasuk travel_tourism_pages
        $builder = $db->table('industry_solutions');
        $solutions = $builder
            ->where('industry_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `industry_use_cases`
WHERE `industry_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getUseCases($pageId)
    {
        $db = \Config\Database::connect();

        // Cek apakah page_id termasuk industry_use_cases
        $builder = $db->table('industry_use_cases');
        $useCases = $builder
            ->where('industry_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `industry_metrics`
WHERE `industry_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getMetrics($pageId)
    {
        $db = \Config\Database::connect();

        // Cek apakah page_id termasuk industry_metrics
        $builder = $db->table('industry_metrics');
        $metrics = $builder
            ->where('industry_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();