app/Models/IndustryModel.php

SELECT *
FROM `industry_use_cases`
WHERE `industry_page_id` = '4'
ORDER BY `display_order` ASC
---
    public function getUseCases($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('industry_use_cases');

        return $builder
            ->where('industry_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `industry_metrics`
WHERE `industry_page_id` = '4'
ORDER BY `display_order` ASC
---
    public function getMetrics($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('industry_metrics');

        return $builder
            ->where('industry_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();