app/Models/OurWorkModel.php

SELECT *
FROM `our_work_stats`
WHERE `our_work_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getStats($ourWorkPageId)
    {
        return $this->db->table('our_work_stats')
            ->where('our_work_page_id', $ourWorkPageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `our_work_case_studies`
WHERE `our_work_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getCaseStudies($ourWorkPageId)
    {
        $caseStudies = $this->db->table('our_work_case_studies')
            ->where('our_work_page_id', $ourWorkPageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `our_work_testimonials`
WHERE `our_work_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getTestimonials($ourWorkPageId)
    {
        return $this->db->table('our_work_testimonials')
            ->where('our_work_page_id', $ourWorkPageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();