app/Models/PressModel.php

    public function getAnnouncements($pressPageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('press_announcements');

        return $builder->select('*')
                      ->where('press_page_id', $pressPageId)
                      ->where('is_published', 1)
                      ->orderBy('display_order', 'ASC')
                      ->orderBy('date', 'DESC')
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `press_announcements`
WHERE `press_page_id` = '1'
AND `is_published` = 1
ORDER BY `display_order` ASC, `date` DESC

    public function getMediaKit($pressPageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('press_media_kit');

        return $builder->select('*')
                      ->where('press_page_id', $pressPageId)
                      ->where('is_active', 1)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `press_media_kit`
WHERE `press_page_id` = '1'
AND `is_active` = 1
ORDER BY `display_order` ASC

    public function getContacts($pressPageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('press_contacts');

        return $builder->select('*')
                      ->where('press_page_id', $pressPageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `press_contacts`
WHERE `press_page_id` = '1'
ORDER BY `display_order` ASC