app/Models/ProcessAutomationModel.php

SELECT *
FROM `process_automation_capabilities`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getCapabilities($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('process_automation_capabilities');

        return $builder->select('*')
                      ->where('page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `process_automation_benefits`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getBenefits($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('process_automation_benefits');

        return $builder->select('*')
                      ->where('page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();