app/Models/ResourcesModel.php

SELECT *
FROM `resources_featured`
WHERE `page_id` = '1'
AND `is_active` = 1
ORDER BY `display_order` ASC
---
    public function getFeaturedResources($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('resources_featured');

        $resources = $builder->select('*')
                      ->where('page_id', $pageId)
                      ->where('is_active', 1)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `resources_articles`
WHERE `page_id` = '1'
AND `is_published` = 1
ORDER BY `display_order` ASC, `date` DESC
---
    public function getArticles($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('resources_articles');

        return $builder->select('*')
                      ->where('page_id', $pageId)
                      ->where('is_published', 1)
                      ->orderBy('display_order', 'ASC')
                      ->orderBy('date', 'DESC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `resources_formats`
WHERE `page_id` = '1'
AND `is_active` = 1
ORDER BY `display_order` ASC
---
    public function getFormats($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('resources_formats');

        return $builder->select('*')
                      ->where('page_id', $pageId)
                      ->where('is_active', 1)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `resources_stats`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getStats($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('resources_stats');

        return $builder->select('*')
                      ->where('page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();