app/Models/ServiceModel.php

    public function getFeatures($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('service_features');

        return $builder
            ->where('service_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `service_features`
WHERE `service_page_id` = '2'
ORDER BY `display_order` ASC

    public function getServices($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('service_services');

        return $builder
            ->where('service_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `service_services`
WHERE `service_page_id` = '2'
ORDER BY `display_order` ASC

    public function getStats($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('service_stats');

        return $builder
            ->where('service_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `service_stats`
WHERE `service_page_id` = '2'
ORDER BY `display_order` ASC

    public function getSteps($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('service_steps');

        return $builder
            ->where('service_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `service_steps`
WHERE `service_page_id` = '2'
ORDER BY `display_order` ASC

    public function getBenefits($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('service_benefits');

        return $builder
            ->where('service_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `service_benefits`
WHERE `service_page_id` = '2'
ORDER BY `display_order` ASC