app/Models/SocialMediaModel.php

    public function getPageByName($pageName)
    {
        return $this->db->table('social_media_pages')
            ->where('page_name', $pageName)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `social_media_pages`
WHERE `page_name` = 'social-media'

    public function getServices($pageId)
    {
        return $this->db->table('social_media_services')
            ->where('social_media_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `social_media_services`
WHERE `social_media_page_id` = '1'
ORDER BY `display_order` ASC

    public function getPlatforms($pageId)
    {
        return $this->db->table('social_media_platforms')
            ->where('social_media_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `social_media_platforms`
WHERE `social_media_page_id` = '1'
ORDER BY `display_order` ASC

    public function getIncluded($pageId)
    {
        return $this->db->table('social_media_included')
            ->where('social_media_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `social_media_included`
WHERE `social_media_page_id` = '1'
ORDER BY `display_order` ASC

    public function getStats($pageId)
    {
        return $this->db->table('social_media_stats')
            ->where('social_media_page_id', $pageId)
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `social_media_stats`
WHERE `social_media_page_id` = '1'
ORDER BY `display_order` ASC