app/Models/StartJourneyModel.php

SELECT *
FROM `start_journey_steps`
WHERE `start_journey_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getProcessSteps($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('start_journey_steps');
        return $builder->where('start_journey_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `start_journey_offices`
WHERE `start_journey_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getOffices($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('start_journey_offices');
        return $builder->where('start_journey_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();