app/Models/TalentModel.php

SELECT *
FROM `talent_benefits`
WHERE `talent_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getBenefits($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('talent_benefits');
        $benefits = $builder->where('talent_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `talent_roles`
WHERE `talent_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getRoles($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('talent_roles');
        $roles = $builder->where('talent_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `talent_process_steps`
WHERE `talent_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getProcessSteps($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('talent_process_steps');
        $steps = $builder->where('talent_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();