app/Models/TechnologyModel.php

SELECT *
FROM `technology_solutions`
WHERE `technology_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getSolutions($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('technology_solutions');
        $solutions = $builder->where('technology_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `technology_use_cases`
WHERE `technology_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getUseCases($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('technology_use_cases');
        $useCases = $builder->where('technology_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();

SELECT *
FROM `technology_metrics`
WHERE `technology_page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getMetrics($pageId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('technology_metrics');
        $metrics = $builder->where('technology_page_id', $pageId)
                      ->orderBy('display_order', 'ASC')
                      ->get()
                      ->getResultArray();