app/Models/WhyStartoutAIModel.php

SELECT *
FROM `why_startout_ai_stats`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getStats($pageId = 1)
    {
        $db = db_connect();
        return $db->table('why_startout_ai_stats')
                 ->where('page_id', $pageId)
                 ->orderBy('display_order', 'ASC')
                 ->get()
                 ->getResultArray();

SELECT *
FROM `why_startout_ai_advantages`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getAdvantages($pageId = 1)
    {
        $db = db_connect();
        return $db->table('why_startout_ai_advantages')
                 ->where('page_id', $pageId)
                 ->orderBy('display_order', 'ASC')
                 ->get()
                 ->getResultArray();

SELECT *
FROM `why_startout_ai_benefits`
WHERE `page_id` = '1'
ORDER BY `display_order` ASC
---
    public function getBenefits($pageId = 1)
    {
        $db = db_connect();
        return $db->table('why_startout_ai_benefits')
                 ->where('page_id', $pageId)
                 ->orderBy('display_order', 'ASC')
                 ->get()
                 ->getResultArray();